Repository: huwung/ProjektOmegaT
Catalog: fenomen/engliska2kinesiska-level2.tmx
Source language: en
Languages: zh

source: *there is no result in brew or brew cask*.
zh: *在brew或brew cask中沒有結果*.

source: According to a survey in 2010[2] among 458 professional translators, OmegaT is used 1/3 as much as Wordfast, Déjà Vu and MemoQ, and 1/8 as much as the market leader Trados.
zh: 在2010年对458名专业译员的调查[2]表明，OmegaT的用户数达到Wordfast、DejaVu和MemoQ的1/3，且达到了市场领导者塔多思的1/8。

source: For glossaries, OmegaT mainly uses tab-delimited plain text files in UTF-8 encoding with the .txt extension.
zh: 对于术语库，OmegaT主要使用tab分隔的UTF-8编码且扩展名为.txt的纯文本文件。

source: It could translate unformatted text files, and HTML, and perform only block-level segmentation (i.e. paragraphs instead of sentences).
zh: 它可以翻譯無格式文本文檔和HTML, 並且只處理區塊水平的文段(即段落替代句子).

source: It is available in 27 languages.
zh: 它的界面和文档被翻译成27种语言。

source: It subsequently saves that database to disk in Translation Memory eXchange (.tmx) format for use another day, in other projects, by other translators, and even with other CAT tools.
zh: 它隨後以翻譯記憶交換文件(.tmx)格式存在硬盤中，以便在以后翻译时重用或者和其他使用OmegaT或其他CAT工具的译员进行交换。

source: It was originally written in C++.
zh: 最初是用C++編寫的.

source: Its features include customisable segmentation using regular expressions, translation memory with fuzzy matching and match propagation, glossary matching, dictionary matching, translation memory and reference material searching, and inline spell-checking using Hunspell spelling dictionaries.
zh: 它的功能包括使用正则表达式的可自定义分段，带有模糊匹配和匹配传播的翻譯記憶，术语库匹配，词典匹配和参考资料搜索以及使用Hunspell拼写词典的内联拼写检查功能。

source: No change, naturally enough, means no such update.
zh: 沒有改變，自然就夠了，意味著沒有這樣的升級。

source: OmegaT handles a translation job as a project, a hierarchy of folders with specific names.
zh: OmegaT將每個翻譯工作作為一個項目，具有特定名稱的文件夾層次結構。

source: OmegaT is intended for professional translators.
zh: OmegaT适用于专业译员。

source: OmegaT runs on Linux, Mac OS X and Microsoft Windows 98 SE or higher,[1] and requires Java 1.5.
zh: OmegaT可运行于Linux、Mac OS X和Microsoft Windows 98 SE或更高版本，[1]并且需要Java 1.5。

source: OmegaT was first developed by Keith Godfrey in 2000.
zh: OmegaT是Keith Godfrey在2000年首先開發的.

source: OmegaT, when directed, generates the (partially) translated versions in the /target/ subfolder.
zh: 而在翻译结束后，已翻译的文档会出现在/target/子文件夹中。

source: Other named folders include ones for automatic consultation within the program: /tm/ for existing translation pairs in .tmx format, /tm/auto/ for automatic translation of 100% matches, /glossary/ for glossaries, /dictionary/ for StarDict (and .tbx) dictionaries.
zh: 在开始翻译前，用户还可以复制以前的翻译记忆到/tm/子文件夹，复制术语库到/glossary/文件夹以及复制StarDict词典到/dictionary/文件夹，在翻译时OmegaT会自动查阅它们。

source: Similarly structured files in standard CSV format are also supported, as well as TBX files.
zh: 还支持使用标准CSV格式的类似结构的文件，对于TBX文件同样如此。

source: Such glossaries can easily be created in a text editor.
zh: 文本编辑器中可以很容易创建这样的术语库。

source: The Editor pane displays the source documents as individual “segments” for translation one segment at at time.
zh: 編輯窗口將源文件顯示為獨立的片段以便於一次翻譯一個片段.

source: The first public release in February 2001[3] was written in Java.
zh: 2001年2月首次公開發布的版本[3]使用Java編寫.

source: The optional Machine Translation pane shows machine translations from Google Translate and similar services.
zh: 如果啟用了機器翻譯，相應的窗口會顯示由Google翻譯或其他類似服務所產生的譯文。

source: The structure of a glossary file is extremely simple: the first column contains the source language word, the second column contains the corresponding target language words, the third column (optional) can contain anything including comments on context etc.
zh: 术语库文件的结构非常简单：首列包含源语言词语，第二列包含对应的目标语言词语，第三列（可省略）与词语相关的上下文注释等。

source: This version used a proprietary translation memory format.
zh: 這個版本採用了用戶翻譯記憶格式.

source: When the user goes to translate a segment in the Editor pane, OmegaT automatically searches the .tmx files in the /tm/ hierarchy for previous translation pairs with similar source sentences and displays them in the Fuzzy Matches pane for insertion into the Editor pane with a keyboard shortcut.
zh: When the user goes to translate a segment in the Editor pane, OmegaT automatically searches the .tmx files in the /tm/ hierarchy for previous translation pairs with similar source sentences and displays them in the Fuzzy Matches pane for insertion into the Editor pane with a keyboard shortcut.进行翻译时，OmegaT会自动检查以前的翻译以寻找类似的句子，找到后会显示在模糊匹配窗格中。

source: When the user leaves a segment, OmegaT normally first adds the source-target pair to its database in memory.
zh: 當用戶完成翻譯並離開某一部分時，OmegaT首先會在記憶庫中的數據庫裡添加一對源文件--目的文件對。
